### TOP 50 SKUS

In this section, I am going to analyze which are the references most sold in the last 6 months (from 1 october 2018 to 31 march 2019).

First of all, we set as path the directory which contains the data

In [10]:
import os

path = '/home/miguel/Escritorio/TFM'
os.chdir(path)

In [11]:
pwd

'/home/miguel/Escritorio/TFM'

Secondly, I import the libraries that I am going to work in this script

In [99]:
import io
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt
%matplotlib inline

After that, I load xlsx file with the required data:
    - References
    - Name References
    - Date time 
    - Net incomes
    - Units sold per transaction

In [13]:
df_bw = pd.read_excel('BW.xlsx', sheet_name="BW")

In [14]:
df_bw.head(5)

,Referencia,Name,T Día natural,Valor neto pedidos,Cantidad en unidades (pedidos)
0,4623,"ESPEJO PUERTA ""LCC"" BLANCO POLIETILENO",11.09.2017,18.93,1
1,4623,"ESPEJO PUERTA ""LCC"" BLANCO POLIETILENO",21.09.2017,18.93,1
2,4623,"ESPEJO PUERTA ""LCC"" BLANCO POLIETILENO",08.10.2017,16.08,1
3,4623,"ESPEJO PUERTA ""LCC"" BLANCO POLIETILENO",16.10.2017,16.08,1
4,4623,"ESPEJO PUERTA ""LCC"" BLANCO POLIETILENO",21.10.2017,16.08,1

I also check the shape and info of this data

In [15]:
df_bw.shape

(37614, 5)

In [16]:
df_bw.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 37614 entries, 0 to 37613
Data columns (total 5 columns):
Referencia                        37614 non-null int64
Name                              37614 non-null object
T Día natural                     37614 non-null object
Valor neto pedidos                37614 non-null float64
Cantidad en unidades (pedidos)    37614 non-null int64
dtypes: float64(1), int64(2), object(2)
memory usage: 1.4+ MB

It is all right.

Then, I continue renaming the columns with the purpose of removing black spaces

In [17]:
df_bw = df_bw.rename(index=str, columns={"Referencia":"Reference", "T Día natural":"Date", "Valor neto pedidos":"Net_Incomes", "Cantidad en unidades (pedidos)":"Units_sold"})

In [18]:
df_bw.head(5)

,Reference,Name,Date,Net_Incomes,Units_sold
0,4623,"ESPEJO PUERTA ""LCC"" BLANCO POLIETILENO",11.09.2017,18.93,1
1,4623,"ESPEJO PUERTA ""LCC"" BLANCO POLIETILENO",21.09.2017,18.93,1
2,4623,"ESPEJO PUERTA ""LCC"" BLANCO POLIETILENO",08.10.2017,16.08,1
3,4623,"ESPEJO PUERTA ""LCC"" BLANCO POLIETILENO",16.10.2017,16.08,1
4,4623,"ESPEJO PUERTA ""LCC"" BLANCO POLIETILENO",21.10.2017,16.08,1

Now, I filter the transactions from 1 october 2018 to 31 march 2019.

To develop correctly this filter, it is necessary to change "Date" column from object type to datetime

In [19]:
from datetime import datetime

In [20]:
df_bw["Date"] = pd.to_datetime(df_bw["Date"], format = '%d.%m.%Y')

In [29]:
df_bw_filter = df_bw[df_bw["Date"]>"10.01.2018"]

In [30]:
df_bw_filter.head(5)

    Reference                      Name       Date  Net_Incomes  Units_sold
33       6558  JARRÓN CILÍNDRICO VIDRIO 2018-12-09        13.97           1
37       6565      JARRÓN ESFERA VIDRIO 2018-11-08        11.08           1
38       6565      JARRÓN ESFERA VIDRIO 2018-11-23        22.14           2
39       6565      JARRÓN ESFERA VIDRIO 2019-02-04        14.90           1
40       6565      JARRÓN ESFERA VIDRIO 2019-03-12        12.31           1

In [31]:
df_bw_filter.shape

(15032, 5)

Once I have obtained the selected data, I group by Reference and I enumerate how many days each reference has been sold during that period in order to be able to find the most sold products with high frequency.

In [53]:
df_bw_groupby = df_bw.groupby(by="Reference").agg({"Date":"count", "Units_sold":"sum","Net_Incomes":"sum"}).sort_values(by='Units_sold',ascending=False)
df_bw_groupby.head(5)

           Date  Units_sold  Net_Incomes
Reference
265400       82        1092          0.0
265600       82        1092          0.0
251900       82         904          0.0
10040        58         562          0.0
10048        48         506          0.0

In [46]:
df_bw_groupby.describe()

              Date   Units_sold   Net_Incomes
count  8477.000000  8477.000000   8477.000000
mean      4.286422     5.971334    260.089599
std       7.488394    13.186183    699.587363
min       1.000000     1.000000      2.150000
25%       1.000000     1.000000     32.930000
50%       2.000000     3.000000     78.350000
75%       4.000000     6.000000    218.600000
max     172.000000   416.000000  14050.750000

After grouping and checking the new dataframe, I should select the most suitable references for this study following these steps:
   - Net_Incomes > 0€ in BW
   - At least more than 30 days with a transaction
   - At least more than 30 days of exposition in Adwords
   - Cost > 0€ in Adwords

Firstly, I filter net incomes over a 0€ and a minimum of 30 days with a transaction

In [56]:
df_bw_groupby = df_bw_groupby[(df_bw_groupby["Net_Incomes"]!=0) & (df_bw_groupby["Date"]>=30)]

Second, I must load the file which contains Adwords data:

In [88]:
df_ads_2018_19 = pd.read_csv('TFM_Datos_2018-19.csv', sep=';', error_bad_lines=True)

/home/miguel/my_project_python/my_project_env/lib/python3.6/site-packages/IPython/core/interactiveshell.py:3049: DtypeWarning: Columns (6) have mixed types. Specify dtype option on import or set low_memory=False.
  interactivity=interactivity, compiler=compiler, result=result)

In [89]:
df_ads_2018_19.sample(5)

,ID de producto,Campaña,ID de la campaña,Tipo de producto (primer nivel),Tipo de producto (segundo nivel),Día,Etiqueta personalizada 1,CPC máximo predeterminado del grupo de anuncios,Moneda,Impresiones,...,CTR,CPC medio,Coste,Conversiones,Todas las conversiones,Tasa de conversión,Coste/conv.,Coste/todas las conversiones,Valor conv./coste,Valor de todas las conversiones/coste
206594,123939,Shop_Muebles_Puffs_Y18_W12,1317839683,muebles,puffs,06/02/2019,40,"0,25",EUR,262.0,...,"0,00 %",0,0,0,0,"0,00 %",0,0,0,0
149353,105589,Shop_Muebles_Sillones y butacas_Y18_W12,1317840426,muebles,sillones y butacas,12/11/2018,300,"0,3",EUR,164.0,...,"0,00 %",0,0,0,0,"0,00 %",0,0,0,0
251140,74510,Shop_Navidad_Muñecos y figuras de navidad_Y18_W12,1323658312,decoración de navidad,muñecos y figuras de navidad,20/12/2018,30,"0,14",EUR,7.0,...,"14,29 %","0,09","0,09",0,0,"0,00 %",0,0,0,0
239514,48745,Shop_Textil_hogar_N1_Y18_W37,1559765508,textil hogar,cortinas y visillos,03/10/2018,20,"0,1",EUR,18.0,...,"0,00 %",0,0,0,0,"0,00 %",0,0,0,0
159512,30539,Shop_Smart_N1_Baño_Y19_W5,1623532023,baño,cestos de ropa,18/03/2019,20,"0,01",EUR,0.0,...,"0,00 %",0,0,0,0,"0,00 %",0,0,0,0

In [90]:
df_ads_2018_19.shape

(447539, 21)

In [91]:
df_ads_2018_19.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 447539 entries, 0 to 447538
Data columns (total 21 columns):
ID de producto                                     447539 non-null int64
Campaña                                            447539 non-null object
ID de la campaña                                   447539 non-null int64
Tipo de producto (primer nivel)                    447539 non-null object
Tipo de producto (segundo nivel)                   447539 non-null object
Día                                                447539 non-null object
Etiqueta personalizada 1                           447539 non-null object
CPC máximo predeterminado del grupo de anuncios    447539 non-null object
Moneda                                             447539 non-null object
Impresiones                                        447539 non-null float64
Clics                                              447539 non-null int64
CTR                                                447539 non-null object
CPC medio                                          447539 non-null object
Coste                                              447539 non-null object
Conversiones                                       447539 non-null object
Todas las conversiones                             447539 non-null object
Tasa de conversión                                 447539 non-null object
Coste/conv.                                        447539 non-null object
Coste/todas las conversiones                       447539 non-null object
Valor conv./coste                                  447539 non-null object
Valor de todas las conversiones/coste              447539 non-null object
dtypes: float64(1), int64(3), object(17)
memory usage: 71.7+ MB

After checking the file, let choosing the required columns to analyze cost and day' transactions

In [104]:
columns_interest = ["ID de producto", "Día", "Coste"]
df_ads = df_ads_2018_19[columns_interest]

In [105]:
df_ads.head(5)

   ID de producto         Día Coste
0          127156  20/02/2019     0
1          104268  16/10/2018     0
2          123872  25/03/2019     0
3          110275  18/12/2018     0
4           49843  16/02/2019     0

Once, I have filtered, I should repeat the same process as in the previous file:
    - Rename columns
    - Column "Día" from string to datetime and column "Coste" from string to float64
    - Groupby by "ID de producto" and agreggate "Día" as count and "Coste" as sum(it is not necessary to filter by date because the file contains the period analyzed)

In [113]:
#Step1: Rename
df_ads = df_ads.rename(index=str, columns={"ID de producto":"Reference", "Día":"Date", "Coste":"Cost"})

#Step2: from string to datetime and float
df_ads["Date"] = pd.to_datetime(df_ads["Date"], format = '%d/%m/%Y')
df_ads["Cost"] = pd.to_numeric(df_ads["Cost"], errors='coerce')

#Step3: grouping
df_ads_groupby = df_ads.groupby(by="Reference").agg({"Date":"count", "Cost":"sum"}).sort_values(by='Date',ascending=False)

In [114]:
df_ads_groupby.head(5)

           Date  Cost
Reference
123759      200   0.0
106198      195   0.0
103989      191   1.0
106186      191   3.0
106159      191   0.0